Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [10]:
#Answer Q1
data = [4, 8, 15, 16, 23, 42]
series = pd.Series(data)

In [ ]:
series

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [12]:
#Answer Q2
l = [2, 4, 6, 8, 10, 12, 14, 16, 18, 20]
series = pd.Series(l)

In [13]:
series

0     2
1     4
2     6
3     8
4    10
5    12
6    14
7    16
8    18
9    20
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

In [19]:
#Answer Q3
df = {'name' : ['Alice','Bob','Claire'] ,
      'age'  : [25,30,27] ,
      'gender' : ['Female' , 'Male' , 'Femail']
        
}

In [17]:
pd.DataFrame(df)

     name  age  gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Femail

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

#Answer Q4

In Pandas, a DataFrame is a two-dimensional labeled data structure with columns that can be of different types (numeric, string, boolean, etc.). It is one of the primary data structures used for data manipulation and analysis in Pandas. Essentially, a DataFrame can be thought of as a table-like structure where each column represents a different variable, and each row represents an observation.

On the other hand, a Series is a one-dimensional labeled array that can hold data of any type. It's similar to a column in a spreadsheet or a single column of data in a DataFrame.

Suppose we have a data of 3 perosn in Q3 with thire "name" "age" and "gender"
we can represent this as a dataFrame 
Name, Age , Gender would be series (column) of this data frame

Q.5 What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [ ]:
#Answer Q5

# Funtion 1 - Set Index  

data = {'a':[2,4,4,5],
        'b':[4,5,6,6],
        'c' : ['mayur','baba','naveen','sagar'] }
df = pd.DataFrame(data)
df.set_index('a') 
#we can set index of any data and choose any column as a index using this funtion 
#we can also you implace so that we can print same output again

In [ ]:

# funtion 2 - dropna

taxomony = pd.read_csv("taxonomy.csv")
taxomony.dropna()

##we use dropna funtion to drop none values in series

In [ ]:

# funtion 2 - dropna

taxomony = pd.read_csv("taxonomy.csv")
taxomony.dropna()

##we use dropna funtion to drop none values in series

In [ ]:

# funtion 3 - fillna

taxomony2 = pd.read_csv("taxonomy.csv")
taxomony.fillna('mayur')

##we use dropna funtion to drop none values in series

Q.6 Which of the following is mutable in nature Series, DataFrame, Panel?


Among the options, both Series and DataFrame are mutable in nature in Pandas. However, Panel is not mutable.

Series: A Series is a one-dimensional array-like structure with labeled data. You can modify the values within a Series after it's created.

DataFrame: A DataFrame is a two-dimensional table-like structure with labeled columns that can contain various data types. You can modify the values within a DataFrame, add or remove columns, and perform various operations to manipulate the data.

Q.7 Create a DataFrame using multiple Series. Explain with an example.

In [50]:
#Answer Q7
df3 = {'name' : ['Alice','Bob','Claire','john','michel','tim'] ,
      'age'  : [25,30,27,45,64,23] ,
      'gender' : ['Female', 'Male','Female','Male','Male','Male'],
       'marks' : [45,43,43,24,45,54]       
}
pd.DataFrame(df3)

     name  age  gender  marks
0   Alice   25  Female     45
1     Bob   30    Male     43
2  Claire   27  Female     43
3    john   45    Male     24
4  michel   64    Male     45
5     tim   23    Male     54